[net]
batch=100
subdivisions=1
height=28
width=28
channels=3 
momentum=0.9
decay=0.0005
max_crop=28

learning_rate=0.01
policy=poly
power=4
max_batches=500

[connected]
output=84
activation = relu 

[connected]
output=10
activation = relu

[softmax]
groups=1

[cost]
type=sse
